payloads/siege-results.log
** SIEGE 4.1.7
** Preparing 11 concurrent users for battle.
The server is now under siege...
HTTP/1.1 200     5.01 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     5.01 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     5.01 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
[...]
HTTP/1.1 200     5.05 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     5.05 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     5.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     5.10 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     5.10 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     5.11 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.91 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.28 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.21 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.37 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.42 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.13 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.11 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.96 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.91 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     3.20 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     3.51 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.35 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.23 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.37 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.24 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.31 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.69 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.27 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.19 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.15 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     5.71 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.18 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.84 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.70 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.17 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.28 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.39 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     6.70 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     7.03 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     1.96 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     7.22 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.35 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.19 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.21 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.40 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.16 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.28 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     6.31 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.37 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.37 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.59 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.15 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.11 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.07 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.08 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.77 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.39 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.15 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.21 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.17 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.30 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.36 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.26 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.11 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.13 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     6.85 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.20 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     5.57 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.09 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.25 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.10 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.09 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.09 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.13 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.78 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.16 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.15 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.09 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     6.80 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.11 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.09 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.30 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.17 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     7.46 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.16 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.15 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.11 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.15 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.09 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.08 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.16 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.07 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.30 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.19 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.20 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.16 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.15 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.27 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.13 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.18 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.74 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.13 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.13 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.11 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     1.97 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.15 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.66 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.17 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200    16.44 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.13 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
Lifting the server siege...
Transactions:		      226    hits
Availability:		      100.00 %
Elapsed time:		       30.05 secs
Data transferred:	        0.11 MB
Response time:		     1242.26 ms
Transaction rate:	        7.52 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        9.34
Successful transactions:      226
Failed transactions:	        0
Longest transaction:	    16440.00 ms
Shortest transaction:	       70.00 ms
 

HTTP/1.1 200     0.09 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.26 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.26 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.34 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.25 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.15 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.40 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.63 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.51 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.34 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.32 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.24 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.87 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.20 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.27 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.24 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.22 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.08 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.25 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     1.89 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.19 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.21 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.17 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.15 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.36 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.90 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.11 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.17 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.23 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.50 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.18 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.11 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.24 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.19 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.42 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.21 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.18 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.19 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.47 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.26 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.20 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.18 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.12 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.11 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.13 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.63 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.15 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.17 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.11 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     6.58 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.18 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.19 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.16 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.15 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.11 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.09 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     7.18 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.22 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.20 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.10 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.25 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.25 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.22 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.07 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.14 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.27 secs:     859 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     7.62 secs:     449 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.16 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     2.18 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve
HTTP/1.1 200     0.32 secs:     525 bytes ==> POST http://localhost:5237/checkin/v1/journeys/retrieve